In [1]:
%load_ext sql

CREATION DES TABLES

In [2]:
%%sql sqlite://
CREATE TABLE Pays (PaysID INTEGER NOT NULL, 
                   PaysNom VARCHAR, 
                   PRIMARY KEY (PaysID));


CREATE TABLE Produits (ProduitID, 
                       ProduitNom, 
                       PRIMARY KEY (ProduitID));

CREATE TABLE Clients (ClientID INTEGER NOT NULL, 
                      ClientNom VARCHAR,
                      PaysID INTEGER, 
                      PRIMARY KEY (ClientID), 
                      FOREIGN KEY (PaysID) REFERENCES Pays(PaysID));  

CREATE TABLE Revenus (TransactionID INTEGER NOT NULL, 
                      Année INTEGER,
                      Montant NUMERIC, 
                      ClientID INTEGER, 
                      ProduitID INTEGER, 
                      Nombre_vendus INTEGER,
                      PRIMARY KEY (TransactionID), 
                      FOREIGN KEY(ClientID) REFERENCES Clients(ClientID), 
                      FOREIGN KEY(ProduitID) REFERENCES Produits(ProduitID));

CREATE TABLE Taxes (Montant_Taxe NUMERIC, 
                    PaysID INTEGER NOT NULL,
                   FOREIGN KEY (PaysID) REFERENCES Pays(PaysID))

Connecting to 'sqlite://'

++
||
++
++

INSERTION DES VALEURS DANS LES TABLES

In [3]:
#Générations de valeurs aléatoires pour la table Revenus
import random

Values_Revenus = []

for x in range(50):
    Année_ = random.randint(1990,2000)
    Montant_ = random.randrange(10000,100000,10000)
    ClientID_ = random.randint(1,18)
    ProduitID_ = random.randint(1,4)
    Nombre_vendus = random.randint(1,5)
    tuple_ = (x, Année_, Montant_, ClientID_, ProduitID_, Nombre_vendus)
    Values_Revenus.append(tuple_)

Values_Revenus

[(0, 1991, 70000, 1, 1, 4),
 (1, 1991, 10000, 10, 2, 3),
 (2, 1991, 70000, 8, 4, 1),
 (3, 1991, 60000, 2, 1, 3),
 (4, 1995, 40000, 12, 3, 5),
 (5, 1995, 90000, 2, 4, 2),
 (6, 1991, 30000, 15, 4, 4),
 (7, 1994, 70000, 16, 4, 5),
 (8, 1998, 60000, 15, 1, 2),
 (9, 1995, 60000, 10, 2, 1),
 (10, 2000, 60000, 17, 3, 1),
 (11, 1999, 60000, 6, 1, 3),
 (12, 1992, 60000, 17, 2, 1),
 (13, 1993, 60000, 8, 2, 5),
 (14, 1998, 40000, 16, 4, 5),
 (15, 1990, 30000, 15, 4, 4),
 (16, 1996, 90000, 13, 4, 3),
 (17, 1998, 40000, 1, 3, 3),
 (18, 2000, 40000, 2, 2, 4),
 (19, 1996, 70000, 7, 3, 2),
 (20, 1994, 30000, 16, 1, 1),
 (21, 1996, 30000, 5, 1, 5),
 (22, 1999, 90000, 8, 1, 2),
 (23, 1999, 20000, 2, 3, 3),
 (24, 1993, 50000, 10, 1, 3),
 (25, 1996, 70000, 16, 2, 1),
 (26, 1998, 20000, 10, 4, 3),
 (27, 1994, 90000, 2, 1, 3),
 (28, 1996, 40000, 16, 2, 3),
 (29, 1991, 10000, 12, 4, 3),
 (30, 1997, 30000, 4, 4, 3),
 (31, 1992, 40000, 10, 1, 3),
 (32, 1995, 40000, 4, 4, 4),
 (33, 1996, 90000, 10, 1, 3),
 (34, 1992, 60000, 2, 2, 4),
 (35, 1994, 30000, 5, 3, 3),
 (36, 1995, 50000, 1, 4, 1),
 (37, 1999, 30000, 3, 3, 2),
 (38, 1991, 30000, 3, 1, 3),
 (39, 1992, 80000, 1, 4, 1),
 (40, 1995, 50000, 16, 2, 2),
 (41, 1997, 90000, 5, 4, 2),
 (42, 1995, 80000, 2, 4, 3),
 (43, 1993, 90000, 13, 2, 3),
 (44, 1996, 20000, 6, 1, 2),
 (45, 1992, 80000, 18, 3, 4),
 (46, 2000, 70000, 17, 1, 2),
 (47, 2000, 50000, 17, 1, 5),
 (48, 1993, 60000, 5, 1, 3),
 (49, 1999, 50000, 6, 4, 4)]

In [4]:
%%sql sqlite://
INSERT INTO Pays
VALUES (1, "France"), (2, "Allemagne"), (3, "Pologne"), (4, "Danemark"), (5, "USA"), (6, "Japon");

INSERT INTO Produits
VALUES (1, "Produit1"), (2, "Produit2"), (3, "Produit3"), (4, "Produit4");

INSERT INTO Clients
VALUES (1, "Client1",2), (2, "Client2",4), (3, "Client3",2), (4, "Client4",2), (5, "Client5",2), (6, "Client6",6), 
(7, "Client7",5), (8, "Client8",1), (9, "Client9",5), (10, "Client10",1), (11, "Client11",3), (12, "Client12",3),
(13, "Client13",3), (14, "Client14",4), (15, "Client15",6), (16, "Client16",5), (17, "Client17",4), (18, "Client18",3);

INSERT INTO Taxes
VALUES (0.15,1), (0.10,2), (0.12,3), (0.13,4), (0.09,5), (0.21,6);

6 rows affected.

4 rows affected.

18 rows affected.

6 rows affected.

++
||
++
++

In [5]:
%%sql
INSERT INTO Revenus
VALUES
(0, 1994, 70000, 16, 1, 2),
 (1, 1990, 40000, 1, 2, 1),
 (2, 1993, 60000, 1, 1, 5),
 (3, 1990, 50000, 7, 1, 1),
 (4, 1994, 50000, 8, 2, 4),
 (5, 1991, 40000, 10, 2, 5),
 (6, 1993, 10000, 11, 4, 2),
 (7, 1996, 50000, 16, 1, 5),
 (8, 1995, 40000, 4, 2, 3),
 (9, 1996, 20000, 16, 3, 2),
 (10, 1993, 60000, 12, 2, 1),
 (11, 2000, 90000, 9, 2, 3),
 (12, 1993, 60000, 11, 1, 2),
 (13, 1990, 10000, 15, 3, 3),
 (14, 1999, 40000, 1, 3, 3),
 (15, 2000, 60000, 11, 1, 2),
 (16, 1997, 90000, 11, 1, 1),
 (17, 1999, 10000, 5, 3, 2),
 (18, 2000, 50000, 1, 3, 4),
 (19, 1996, 90000, 17, 3, 5),
 (20, 1994, 80000, 6, 1, 1),
 (21, 1998, 30000, 7, 1, 5),
 (22, 1991, 30000, 17, 4, 5),
 (23, 1993, 30000, 9, 2, 1),
 (24, 1998, 60000, 16, 1, 2),
 (25, 1997, 90000, 7, 1, 4),
 (26, 2000, 30000, 9, 3, 4),
 (27, 1997, 80000, 12, 2, 5),
 (28, 1990, 30000, 18, 4, 2),
 (29, 1998, 40000, 4, 2, 1),
 (30, 1997, 20000, 9, 2, 1),
 (31, 2000, 40000, 9, 4, 5),
 (32, 1991, 80000, 7, 4, 1),
 (33, 1990, 30000, 2, 3, 1),
 (34, 1991, 50000, 8, 2, 1),
 (35, 1994, 80000, 15, 2, 3),
 (36, 1997, 80000, 4, 2, 2),
 (37, 1991, 70000, 4, 2, 3),
 (38, 2000, 30000, 12, 1, 3),
 (39, 1999, 50000, 17, 4, 3),
 (40, 1990, 50000, 8, 1, 3),
 (41, 1996, 60000, 3, 4, 2),
 (42, 1999, 10000, 9, 3, 3),
 (43, 2000, 20000, 18, 2, 3),
 (44, 1996, 70000, 12, 1, 1),
 (45, 1992, 20000, 15, 4, 2),
 (46, 1990, 20000, 4, 2, 5),
 (47, 1998, 90000, 11, 1, 1),
 (48, 1998, 70000, 9, 2, 1),
 (49, 1997, 90000, 12, 3, 2)

Running query in 'sqlite://'

50 rows affected.

++
||
++
++

In [74]:
%%sql

SELECT * FROM Clients;

Running query in 'sqlite://'

+----------+-----------+--------+
| ClientID | ClientNom | PaysID |
+----------+-----------+--------+
|    1     |  Client1  |   2    |
|    2     |  Client2  |   4    |
|    3     |  Client3  |   2    |
|    4     |  Client4  |   2    |
|    5     |  Client5  |   2    |
|    6     |  Client6  |   6    |
|    7     |  Client7  |   5    |
|    8     |  Client8  |   1    |
|    9     |  Client9  |   5    |
|    10    |  Client10 |   1    |
+----------+-----------+--------+
Truncated to displaylimit of 10.

In [7]:
%%sql
SELECT * FROM Revenus;

Running query in 'sqlite://'

+---------------+-------+---------+----------+-----------+---------------+
| TransactionID | Année | Montant | ClientID | ProduitID | Nombre_vendus |
+---------------+-------+---------+----------+-----------+---------------+
|       0       |  1994 |  70000  |    16    |     1     |       2       |
|       1       |  1990 |  40000  |    1     |     2     |       1       |
|       2       |  1993 |  60000  |    1     |     1     |       5       |
|       3       |  1990 |  50000  |    7     |     1     |       1       |
|       4       |  1994 |  50000  |    8     |     2     |       4       |
|       5       |  1991 |  40000  |    10    |     2     |       5       |
|       6       |  1993 |  10000  |    11    |     4     |       2       |
|       7       |  1996 |  50000  |    16    |     1     |       5       |
|       8       |  1995 |  40000  |    4     |     2     |       3       |
|       9       |  1996 |  20000  |    16    |     3     |       2       |
+---------------+-------+---------+----------+-----------+---------------+
Truncated to displaylimit of 10.

In [9]:
%%sql
SELECT * FROM Pays;

Running query in 'sqlite://'

+--------+-----------+
| PaysID |  PaysNom  |
+--------+-----------+
|   1    |   France  |
|   2    | Allemagne |
|   3    |  Pologne  |
|   4    |  Danemark |
|   5    |    USA    |
|   6    |   Japon   |
+--------+-----------+

In [64]:
%%sql
SELECT * FROM Taxes;

Running query in 'sqlite://'

+--------------+--------+
| Montant_Taxe | PaysID |
+--------------+--------+
|     0.15     |   1    |
|     0.1      |   2    |
|     0.12     |   3    |
|     0.13     |   4    |
|     0.09     |   5    |
|     0.21     |   6    |
+--------------+--------+

COMBIEN CHAQUE PAYS COMPTE-T-IL DE CLIENTS ?

In [6]:
%%sql sqlite://

SELECT COUNT(Clients.PaysID) AS "Nombre de clients", Pays.PaysNom AS "Pays"
FROM Clients
INNER JOIN Pays ON Clients.PaysID = Pays.PaysID
GROUP BY Clients.PaysID
ORDER BY "Nombre de clients" DESC;

+-------------------+-----------+
| Nombre de clients |    Pays   |
+-------------------+-----------+
|         4         |  Pologne  |
|         4         | Allemagne |
|         3         |    USA    |
|         3         |  Danemark |
|         2         |   Japon   |
|         2         |   France  |
+-------------------+-----------+

QUEL MONTANT DE TRANSACTIONS CHAQUE CLIENT REPRESENTE-T-IL PAR AN ? NE RETOURNER QUE LES CLIENTS REPRESENTANT 50 000 € OU PLUS DE TRANSACTIONS ANNUELLES.

In [23]:
%%sql sqlite://

SELECT Revenus.Année AS Année, Clients.ClientNom AS Client, SUM(Revenus.Montant) AS "Transactions Totales"
FROM Revenus
JOIN Clients ON Revenus.ClientID = Clients.ClientID
GROUP BY Année, Client
HAVING SUM(Revenus.Montant) >= 50000
ORDER BY Année ASC, "Transactions Totales" DESC;

+-------+----------+----------------------+
| Année |  Client  | Transactions Totales |
+-------+----------+----------------------+
|  1990 | Client8  |        50000         |
|  1990 | Client7  |        50000         |
|  1991 | Client7  |        80000         |
|  1991 | Client4  |        70000         |
|  1991 | Client8  |        50000         |
|  1993 | Client11 |        70000         |
|  1993 | Client12 |        60000         |
|  1993 | Client1  |        60000         |
|  1994 | Client6  |        80000         |
|  1994 | Client15 |        80000         |
+-------+----------+----------------------+
Truncated to displaylimit of 10.

MODIFICATION DE LA TABLE PRODUITS

In [11]:
%%sql sqlite://
SELECT * FROM Produits

+-----------+------------+
| ProduitID | ProduitNom |
+-----------+------------+
|     1     |  Produit1  |
|     2     |  Produit2  |
|     3     |  Produit3  |
|     4     |  Produit4  |
+-----------+------------+

In [12]:
%%sql sqlite://
ALTER TABLE Produits
ADD "Coût unitaire" NUMERIC;

++
||
++
++

In [15]:
%%sql sqlite://
UPDATE Produits
SET "Coût unitaire" = (
  CASE 
    WHEN ProduitNom="Produit1" THEN 1000
    WHEN ProduitNom="Produit2" THEN 1000
    WHEN ProduitNom="Produit3" THEN 10000
    WHEN ProduitNom="Produit4" THEN 10000
END 
)

4 rows affected.

++
||
++
++

In [16]:
%%sql sqlite://
SELECT * FROM Produits

+-----------+------------+---------------+
| ProduitID | ProduitNom | Coût unitaire |
+-----------+------------+---------------+
|     1     |  Produit1  |      1000     |
|     2     |  Produit2  |      1000     |
|     3     |  Produit3  |     10000     |
|     4     |  Produit4  |     10000     |
+-----------+------------+---------------+

QUEL BENEFICE L'ENTREPRISE A-T-ELLE RECOLTE DE CHAQUE PRODUIT ? INTEGRER LES TAXES.

In [75]:
%%sql sqlite://

SELECT Produits.ProduitNom AS "Produit", 
CAST(SUM((Revenus.Montant - (Produits."Coût unitaire"*Revenus.Nombre_vendus) - Revenus.Montant*Taxes.Montant_Taxe)) AS INT) 
AS "Bénéfice total"
FROM Produits
INNER JOIN Revenus ON Produits.ProduitID = Revenus.ProduitID
INNER JOIN Clients ON Revenus.ClientID = Clients.ClientID
INNER JOIN Taxes ON Clients.PaysID = Taxes.PaysID
GROUP BY "Produit"
ORDER BY "Produit"
;

+----------+----------------+
| Produit  | Bénéfice total |
+----------+----------------+
| Produit1 |     792200     |
| Produit2 |     732100     |
| Produit3 |     46100      |
| Produit4 |     63800      |
+----------+----------------+

ASSIGNER A CHAQUE PAYS UN RANG EN POUR L'ANNEE 1991 EN FONCTION DU MONTANT DE TRANSACTIONS EFFECTUEES DANS CE PAYS.

In [76]:
%%sql sqlite://

SELECT ROW_NUMBER() OVER (ORDER BY Montant DESC) AS Classement
, Pays.PaysNom AS Pays
, Montant
FROM Revenus
INNER JOIN Clients ON Revenus.ClientID = Clients.ClientID
INNER JOIN Pays ON Clients.PaysID = Pays.PaysID
WHERE Année = 1991;

+------------+-----------+---------+
| Classement |    Pays   | Montant |
+------------+-----------+---------+
|     1      |    USA    |  80000  |
|     2      | Allemagne |  70000  |
|     3      |   France  |  50000  |
|     4      |   France  |  40000  |
|     5      |  Danemark |  30000  |
+------------+-----------+---------+